module.exports = {
  WAREHOUSE_MAP: { '880000000': 6, '940000000': 7, '960000000': 8, '120000000': 9 },
  PAY_TYPE_MAP: {
    'چک': 'CHECK', 'درگاه پرداخت': 'GATEINFO', 'پوز': 'POS', 'پایا': 'SHABA', 'شبا': 'SHABA', 'ساتنا': 'SHABA',
    'پایا یا ساتنا': 'SHABA', 'کارت به کارت': 'CARD_TO_CARD', 'سفته': 'SEFTE', 'حساب به حساب': 'DEPOSIT'
  },
  PROJECT_NAME: 'هتل ۵ ستاره مرکوری کیش',
  COOP_NAME: 'شرکت تعاونی ستایش ماندگار آفرینش',

  // ستون‌های پیش‌پرداخت جا مانده
  COL_EM: 'EM', COL_EN: 'EN', COL_EO: 'EO', COL_EP: 'EP', COL_EQ: 'EQ', COL_ER: 'ER',

  // بلوک‌های اقساط
  INST_BLOCKS: [
    [63,64,65,66,67,68,'I1'], [69,70,71,72,73,74,'I2'], [75,76,77,78,79,80,'I3'], [81,82,83,84,85,86,'I4'],
    [87,88,89,90,91,92,'I5'], [93,94,95,96,97,98,'I6'], [99,100,101,102,103,104,'I7'], [105,106,107,108,109,110,'I8'],
    [111,112,113,114,115,116,'I9'], [117,118,119,120,121,122,'I10'], [123,124,125,126,127,128,'I11'], [129,130,131,132,133,134,'I12']
  ],
};
